# IsInside Method (Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Curve..::..IsInside Method (Double)
Curve Class See Also
---
Indicates whether the specified parameter value is within this curve's bounds.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInside(
	double parameter
)
```

Visual Basic
---
```text
Public Function IsInside ( _
	parameter As Double _
) As Boolean
```

Visual C++
---
```text
public:
bool IsInside(
	double parameter
)
```

# ### Parameters
parameter
    Type: System..::..DoubleThe raw curve parameter to be evaluated.
# ### Return Value
True if the parameter is within the bounds, otherwise false.
# Remarks
Always returns true if this curve is unbound.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the specified parameter is infinite. |

# See Also
Curve Class
IsInside Overload
Autodesk.Revit.DB Namespace